quanhengwen/STM32F1xWorkSpace19/Driver/Components/SCR/BQ26100Slave - 20190722.C
#include "BQ26100Slave.H"	

#include "stm32f10x_exti.h"

#include "STM32_TIM.H"
#include "STM32_EXTI.H"
#include "STM32_GPIO.H"
#include "STM32_SYSTICK.H"

#include "STM32F10x_BitBand.H"

#include 	"CRC.H"

#include "BQ26100DATA.H"

#include	"stdio.h"			//用于printf
#include	"string.h"		//用于printf
#include	"stdarg.h"		//用于获取不确定个数的参数
#include	"stdlib.h"		//malloc动态申请内存空间

#define	BQ26100slavePort					GPIOA
#define	BQ26100slavePin						GPIO_Pin_6

#define	SetBQ26100slavePinLevel		PA6
#define	GetBQ26100slavePinLevel		PA6in

#define	SetBQ26100slavePinOutL		{	/*SetBQ26100slavePinLevel=0;*/\
																	GPIOA->CRL&=0xF7FFFFFF;\
																	GPIOA->CRL|=0x07000000;\
																	SetBQ26100slavePinLevel=0;}		//配置为OD输出模式并拉低
#define	SetBQ26100slavePinOutH		{	/*SetBQ26100slavePinLevel=0;*/\
																	GPIOA->CRL&=0xF7FFFFFF;\
																	GPIOA->CRL|=0x07000000;\
																	SetBQ26100slavePinLevel=1;}		//配置为OD输出模式并拉低
													
#define	SetBQ26100slavePinIntrr	{	GPIOA->CRL&=0xF0FFFFFF;\
																	GPIOA->CRL|=0x08000000;\
																	/*SetBQ26100slavePinLevel=1;*/}			//配置为上拉输入模式

unsigned char bqrecord[64]={0};
unsigned char crflag=0;
bq26100slave_def* SDQ_SAMPLE=0;
RCC_ClocksTypeDef bqRCC_ClocksStatus;				//时钟状态---时钟值


/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void api_bq26100slave_configuration(bq26100slave_def *sSDQ)		//SDQ从机设备配置
{
	SDQ_SAMPLE	=	sSDQ;
	EXTI_Configuration_ITF(BQ26100slavePort, BQ26100slavePin);		//外部边沿触发中断配置,抢占1，响应1--20171213	
	
	RCC_GetClocksFreq(&bqRCC_ClocksStatus);		//获取时钟参数
	SDQ_SAMPLE->time.timeper=bqRCC_ClocksStatus.SYSCLK_Frequency/8000000;
}
//------------------------------------------------------------------------------


/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void api_bq26100slave_server(void)		//SDQ从机设备服务
{
	static unsigned short time = 0;
	//====================查询摘要
	api_bq26100slave_set_digest();
//	//====================有错误
//	if(api_bq26100slave_get_error_status())		//无错误返回0，有错误返回1
//	{
//		if(time++>1000)
//		{
//			api_bq26100slave_reset_error_status();
//		}
//	}
//	else
//	{
//		time = 0;
//	}
}
//------------------------------------------------------------------------------


/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_process(void)
{
	//unsigned long fitime=0;
	//----滤波
	SDQ_SAMPLE->time.time1=SysTick_ReLoad();			//设置SYSTICK初始值
	SDQ_SAMPLE->data.intrrcout++;									//中断次数计数
	if(SDQ_SAMPLE->data.receivelen<4)
	{
		api_bq26100slave_Initialize();
	}
	else
	{
		//SetBQ26100slavePinLevel=0;
		api_bq26100slave_command_process();
	}
	return 0;
}
//------------------------------------------------------------------------------


/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_Initialize(void)
{
	unsigned char byted = api_bq26100slave_receive_byte();						//返回0--未读完一字节，返回1--读完一字节，返回0xFF--复位信号
	//------------------------每次命令先传rom、ram、地址低位、地址高位
	//---------------------等待接收完一字节
	if(1==byted)	//未接收完一字节
	{
		//-------------------获取ROM命令
		if(1==SDQ_SAMPLE->data.receivelen)
		{
			SDQ_SAMPLE->RomCmd	=	(sdq_rom_cmd)SDQ_SAMPLE->data.receive[0];
		}
		//-------------------获取RAM命令
		else if(2==SDQ_SAMPLE->data.receivelen)
		{
			SDQ_SAMPLE->MemCmd	=	(sdq_mem_cmd)SDQ_SAMPLE->data.receive[1];
			//api_bq26100slave_MenCmd();
		}
		//-------------------获取地址低字节
		else if(3==SDQ_SAMPLE->data.receivelen)
		{
			SDQ_SAMPLE->data.addressL	=	(sdq_mem_cmd)SDQ_SAMPLE->data.receive[2];
		}
		//-------------------获取地址高字节
		else if(4==SDQ_SAMPLE->data.receivelen)
		{
			SDQ_SAMPLE->data.addressH	=	(sdq_mem_cmd)SDQ_SAMPLE->data.receive[3];
			api_bq26100slave_MenCmd();
		}
		return 1;
	}
	//---------------------复位信号
	else if(0xFF == byted)
	{
		api_bq26100slave_start();
		api_bq26100slave_default();
	}
	return 0;
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_command_process(void)
{
	unsigned char time = 0;
	//========================数据接收或者读取:发送CRC，message原值、status、digest
	//------------------主机写消息
	if(sdq_mem_write_message==SDQ_SAMPLE->MemCmd)
	{
		api_bq26100slave_write_message();
	}
	//------------------主机读摘要
	else if((sdq_mem_read_digest==SDQ_SAMPLE->MemCmd)&&(20==SDQ_SAMPLE->data.Message.MessageLen))
	{
		api_bq26100slave_read_digest();
	}
	//------------------主机读控制寄存器
	else if((sdq_mem_read_control==SDQ_SAMPLE->MemCmd)&&(20==SDQ_SAMPLE->data.Message.MessageLen))
	{
		api_bq26100slave_read_control();
	}
	//------------------主机写控制寄存器
	else if((sdq_mem_write_control==SDQ_SAMPLE->MemCmd)&&(20==SDQ_SAMPLE->data.Message.MessageLen))
	{
		api_bq26100slave_write_control();
	}
	while(0==GetBQ26100slavePinLevel)	//低电平
	{
		SysTick_DeleyuS(1);				//SysTick延时nuS
		if(time++>200)
			api_bq26100slave_start();
	}
	return 1;
}
//------------------------------------------------------------------------------


