quanhengwen/STM32F1xWorkSpace19/Driver/Components/SCR/BQ26100Slave - 20190722.C
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_MenCmd(void)
{
	//------------------主机写消息
	if(sdq_mem_write_message==SDQ_SAMPLE->MemCmd)
	{
		//---------------Message
		SDQ_SAMPLE->data.Message.MessageLen	=	0;
		//---------------
		SDQ_SAMPLE->status					=	sdq_master_write;
		//---------------
		SDQ_SAMPLE->data.CtlFlag		=	0;
		//---------------
		SDQ_SAMPLE->data.Digest.Serial	=	0;
		
		
		//---------------Digest
		SDQ_SAMPLE->data.Digest.Flag.Auth	=	0;
		
		//---------------Ctrl
		SDQ_SAMPLE->data.Ctrl.Read.Times	=	0;
		
		SDQ_SAMPLE->data.Ctrl.Flag.Start	=	0;
	}
	//------------------主机读摘要
	else if(sdq_mem_read_digest==SDQ_SAMPLE->MemCmd)
	{		
		SDQ_SAMPLE->status							=	sdq_master_readCRC;
		SDQ_SAMPLE->data.Digest.Flag.Start	=	0;
		SDQ_SAMPLE->data.Digest.Serial	=	0;
	}
	//------------------主机读控制寄存器
	else if(sdq_mem_read_control==SDQ_SAMPLE->MemCmd)
	{
		SDQ_SAMPLE->data.Ctrl.Read.Serial	=	0;
		SDQ_SAMPLE->status					=	sdq_master_readCRC;
	}
	//------------------主机写控制寄存器
	else if(sdq_mem_write_control==SDQ_SAMPLE->MemCmd)
	{		
		SDQ_SAMPLE->data.Ctrl.Write.Serial	=	0;
		SDQ_SAMPLE->data.Ctrl.Flag.Start		=	0;
		
		//---------------Digest
		SDQ_SAMPLE->data.Digest.Flag.Auth	=	1;
		SDQ_SAMPLE->data.Digest.Flag.Digested	=	0;
		
		SDQ_SAMPLE->status									=	sdq_master_write;
	}
	
	//SDQ_SAMPLE->data.SendBitLen	=	0;
	return 1;
}
//------------------------------------------------------------------------------


/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void api_bq26100slave_set_digest(void)
{
	if((1==SDQ_SAMPLE->data.Digest.Flag.Auth)		//未启动转换:发回message
		&&(0==SDQ_SAMPLE->data.Digest.Flag.Digested))
	{
		unsigned short i = 0;
		for(i=0;i<bq26100BufferSize;i++)
		{
			if(0==memcmp(SDQ_SAMPLE->data.Message.Buffer,bq26100_sample_data[i][0],20))
			{
				memcpy(SDQ_SAMPLE->data.Digest.Buffer,bq26100_sample_data[i][1],20);
				break;
			}
		}
		//------------------------未匹配到数据
		if(i>=bq26100BufferSize)
		{
			api_bq26100slave_digest_match_error();
			memset(SDQ_SAMPLE->data.Digest.Buffer,0x00,20);
		}
		SDQ_SAMPLE->data.Digest.Flag.Digested = 1;
	}
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_read_digest(void)
{
	//====================第一步:主机读取RAM命令和两字节地址校验
	if(sdq_master_readCRC	==	SDQ_SAMPLE->status)
	{
		if(0==SDQ_SAMPLE->data.Digest.Flag.Start)
		{
			//---------------------RAM命令和两字节地址校验
			SDQ_SAMPLE->data.SendByte	=		CRC8_8541_lsb(&SDQ_SAMPLE->data.receive[1],3);
			SDQ_SAMPLE->data.Digest.Flag.Start	=	1;
		}
		if(1==api_bq26100slave_send_byte())	//返回1表示发送完一字节
		{				
			//SDQ_SAMPLE->data.SendByte	=	SDQ_SAMPLE->data.message[SDQ_SAMPLE->data.messgaelen-1];
			SDQ_SAMPLE->status	=	sdq_master_read;
			SDQ_SAMPLE->data.Digest.Flag.Start	=	0;
		}
		return 1;
	}
	//====================第二步:返回消息摘要
	else if(sdq_master_read	==	SDQ_SAMPLE->status)
	{
		//----------------未启动传输
		if(0==SDQ_SAMPLE->data.Digest.Flag.Start)		//未设置消息
		{	
			//--------------第一次返回摘要为原message消息----未设置控制位
			if(0==SDQ_SAMPLE->data.Digest.Flag.Auth)		//未启动转换:发回message
			{
				memcpy(SDQ_SAMPLE->data.Digest.Buffer,SDQ_SAMPLE->data.Message.Buffer,20);
				crflag	=	0;
			}
			else
			{
				crflag	=	1;
			}
			//--------------第二次返回摘要为转换后的摘要消息--已设置控制位，如果未匹配到摘要则做异常处理
//			else
//			{
//				unsigned short i = 0;
//				for(i=0;i<bq26100BufferSize;i++)
//				{
//					if(0==memcmp(SDQ_SAMPLE->data.Message.Buffer,bq26100_sample_data[i][0],20))
//					{
//						memcpy(SDQ_SAMPLE->data.Digest.Buffer,bq26100_sample_data[i][1],20);
//						break;
//					}
//				}
//				//------------------------未匹配到数据
//				if(i>=bq26100BufferSize)
//				{
//					api_bq26100slave_digest_match_error();
//					return 0;
//				}
//			}
			//--------------启动发送
			SDQ_SAMPLE->data.Digest.Flag.Start	=	1;
			SDQ_SAMPLE->data.Digest.Serial			=	0;
			
			SDQ_SAMPLE->data.SendByte		=	SDQ_SAMPLE->data.Digest.Buffer[SDQ_SAMPLE->data.Digest.Serial];				
		}
		//----------------已启动传输
		//===========================发送数据
		if(1==api_bq26100slave_send_byte())	//返回1表示发送完一字节
		{				
			//SDQ_SAMPLE->data.SendByte	=	SDQ_SAMPLE->data.message[SDQ_SAMPLE->data.messgaelen-1];
			SDQ_SAMPLE->data.Digest.Serial	+=	1;		//已发送数量计数
			if(20>SDQ_SAMPLE->data.Digest.Serial)
			{
				SDQ_SAMPLE->data.SendByte		=	SDQ_SAMPLE->data.Digest.Buffer[SDQ_SAMPLE->data.Digest.Serial];
			}
			//--------------发送所有的Digest数据校验
			else if(20==SDQ_SAMPLE->data.Digest.Serial)
			{
				SDQ_SAMPLE->data.SendByte		=	CRC8_8541_lsb(SDQ_SAMPLE->data.Digest.Buffer,20);
			}
			else	//发送完摘要和CRC
			{
				SDQ_SAMPLE->status							=	sdq_ilde;
				SDQ_SAMPLE->data.receivelen	=	0;
				if(1==SDQ_SAMPLE->data.Digest.Flag.Auth)		//未启动转换:发回message
				{
					crflag	=	0;
				}
				return 1;
			}					
		}
		SDQ_SAMPLE->status					=	sdq_master_read;
		return 1;
	}
	return 0;
}
//------------------------------------------------------------------------------



/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_write_message(void)
{
	//====================第一步:主机写数据
	if(sdq_master_write	==	SDQ_SAMPLE->status)
	{
		unsigned char receive_result=api_bq26100slave_receive_byte();
		if(1==receive_result)		//接收完一字节
		{
			if(SDQ_SAMPLE->data.Message.MessageLen<20)	//message合法字节数据只能为20
			{
				SDQ_SAMPLE->data.Message.Buffer[SDQ_SAMPLE->data.Message.MessageLen]	=	SDQ_SAMPLE->data.RcvByte;
				SDQ_SAMPLE->data.Message.MessageLen		+=	1;
				
