quanhengwen/STM32F1xWorkSpace19/Driver/Components/SCR/BQ26100Slave - 20190722.C
				//----------------主机发送完第一字节message后需要读取"RAM命令和两字节地址长度和数据"校验
				if(1==SDQ_SAMPLE->data.Message.MessageLen)
				{					
					SDQ_SAMPLE->data.SendByte		=	CRC8_8541_lsb(&SDQ_SAMPLE->data.receive[1],SDQ_SAMPLE->data.receivelen-1);
				}
				//----------------主机发完第二条message后的校验方式:当前地址与当前数据异或出结果再求对应结果的CRC
				else
				{
					unsigned char temp=(SDQ_SAMPLE->data.Message.MessageLen-1)^SDQ_SAMPLE->data.Message.Buffer[SDQ_SAMPLE->data.Message.MessageLen-1];
					SDQ_SAMPLE->data.SendByte		=	CRC8_8541_lsb(&temp,1);
				}
				//----------------主机每发送完一字节数据后需要读取CRC
				SDQ_SAMPLE->status	=	sdq_master_readCRC;				
				return 1;
			}
			//协议失败:发送数据个数超过20个字节
			else
			{
			}
			return 0;		//协议失败:发送数据个数超过20个字节
		}
		else if(0xFF==receive_result)
		{
			api_bq26100slave_start();
		}
		return 1;
	}
	//====================主机读CRC和数据时，启动bit只能为1
	//====================第二步:主机读CRC，主机读完CRC后读回原字节数据
	else if(sdq_master_readCRC	==	SDQ_SAMPLE->status)
	{
		if(1==api_bq26100slave_send_byte())	//返回1表示发送完一字节
		{
			SDQ_SAMPLE->data.SendByte	=	SDQ_SAMPLE->data.Message.Buffer[SDQ_SAMPLE->data.Message.MessageLen-1];
			SDQ_SAMPLE->status	=	sdq_master_read;
			return 1;
		}
	}
	//====================第三步:主机读回数据,读回数据后主机继续发送下一字节数据，直到主机发送完20个字节
	else if(sdq_master_read	==	SDQ_SAMPLE->status)
	{
		if(1==api_bq26100slave_send_byte())	//返回1表示发送完一字节
		{
			if(20	<=	SDQ_SAMPLE->data.Message.MessageLen)
			{
				SDQ_SAMPLE->status	=	sdq_ilde;						//空闲:主机发送完所有的message
				SDQ_SAMPLE->data.receivelen	=	0;
			}
			else
			{
				SDQ_SAMPLE->status	=	sdq_master_write;		//主机继续发送下一字节数据
			}
		}
		return 1;
	}
	return 0;
}
//------------------------------------------------------------------------------



/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_read_control(void)
{
	//----------------第一步:上传RAM,AddressL,AddressH校验
	//----------------第二步:上传00地址状态值
	//----------------第三步:上传01地址状态值
	//----------------第四步:上传(RAM,AddressL,AddressH)&(RAM,AddressL,AddressH校验结果)&(00地址内容)&(01地址内容)的CRC校验
	//====================第一步:主机读取RAM命令和两字节地址校验
	if(sdq_master_readCRC	==	SDQ_SAMPLE->status)
	{
		if(0==SDQ_SAMPLE->data.Ctrl.Flag.Start)
		{
			//---------------------RAM命令和两字节地址校验
			if(0	==	SDQ_SAMPLE->data.Ctrl.Read.Times)
			{				
				SDQ_SAMPLE->data.Ctrl.Read.CrcData	=	CRC8_8541_lsb(&SDQ_SAMPLE->data.receive[1],3);				
				SDQ_SAMPLE->data.Ctrl.Read.Ctrl0		=	0x04;
				SDQ_SAMPLE->data.Ctrl.Read.Ctrl1		=	0xA1;
			}
			else if(1	==	SDQ_SAMPLE->data.Ctrl.Read.Times)
			{				
				SDQ_SAMPLE->data.Ctrl.Read.CrcData	=	CRC8_8541_lsb(&SDQ_SAMPLE->data.receive[1],3);
				SDQ_SAMPLE->data.Ctrl.Read.Ctrl0		=	0x06;
				SDQ_SAMPLE->data.Ctrl.Read.Ctrl1		=	0xA1;
			}
			SDQ_SAMPLE->data.SendByte						=	SDQ_SAMPLE->data.Ctrl.Read.CrcData;
			SDQ_SAMPLE->data.Ctrl.Flag.Start		=	1;
		}
		if(1==api_bq26100slave_send_byte())	//返回1表示发送完一字节
		{	
			if(0 == SDQ_SAMPLE->data.Ctrl.Read.Serial)		//未传输数据
			{
				SDQ_SAMPLE->data.SendByte	=	SDQ_SAMPLE->data.Ctrl.Read.Ctrl0;
				SDQ_SAMPLE->status	=	sdq_master_read;
			}
			else if(2 == SDQ_SAMPLE->data.Ctrl.Read.Serial)	//发送完最后一个CRC
			{
				SDQ_SAMPLE->status	=	sdq_ilde;
				SDQ_SAMPLE->data.Ctrl.Flag.Start	=	0;
				SDQ_SAMPLE->data.Ctrl.Read.Times	+=1;
				SDQ_SAMPLE->data.receivelen	=	0;
			}
		}
		return 1;
	}
	//----------------主机读数据
	else if(sdq_master_read	==	SDQ_SAMPLE->status)
	{
		if(1==api_bq26100slave_send_byte())			//返回1表示发送完一字节
		{	
			SDQ_SAMPLE->data.Ctrl.Read.Serial	+=1;
			if(1 == SDQ_SAMPLE->data.Ctrl.Read.Serial)
			{
				SDQ_SAMPLE->data.SendByte	=	SDQ_SAMPLE->data.Ctrl.Read.Ctrl1;
				SDQ_SAMPLE->status	=	sdq_master_read;
			}
			else if(2 == SDQ_SAMPLE->data.Ctrl.Read.Serial)
			{
				unsigned char buffer[6]={0};
				memcpy(buffer,&SDQ_SAMPLE->data.receive[1],3);
				buffer[3]	=	SDQ_SAMPLE->data.Ctrl.Read.CrcData;
				buffer[4]	=	SDQ_SAMPLE->data.Ctrl.Read.Ctrl0;
				buffer[5]	=	SDQ_SAMPLE->data.Ctrl.Read.Ctrl1;
				SDQ_SAMPLE->data.SendByte	=	CRC8_8541_lsb(buffer,6);
				SDQ_SAMPLE->status	=	sdq_master_readCRC;
			}
		}
		return 1;
	}
	return 0;
}
//------------------------------------------------------------------------------



/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_write_control(void)
{
	//====================第一步:主机写数据
	if(sdq_master_write	==	SDQ_SAMPLE->status)
	{
		//------------------第一步:接收第一个数据
		if(1==api_bq26100slave_receive_byte())	//未接收完一字节
		{
			SDQ_SAMPLE->data.Ctrl.Write.Serial+=1;
			//------------------主机发完第一个状态寄存器：下一步返回CRC
			if(1 == SDQ_SAMPLE->data.Ctrl.Write.Serial)
			{
				//----------------主机发送第一个字节
				SDQ_SAMPLE->data.Ctrl.Write.Ctrl0R	=	SDQ_SAMPLE->data.RcvByte;				
				//----------------从机需要返回的状态值
				SDQ_SAMPLE->data.Ctrl.Write.Ctrl0T	=	0x06;
				//----------------主机发送完第一字节控制寄存器值后需要读取"RAM命令和两字节地址长度和数据"校验
				SDQ_SAMPLE->data.SendByte		=	CRC8_8541_lsb(&SDQ_SAMPLE->data.receive[1],SDQ_SAMPLE->data.receivelen-1);
				//----------------下一条操作为向主机返回CRC
				SDQ_SAMPLE->status	=	sdq_master_readCRC;
			}
			//------------------主机发完第二个状态寄存器：下一步返回CRC
			else if(2 == SDQ_SAMPLE->data.Ctrl.Write.Serial)
			{
				unsigned char temp	=	0;
				SDQ_SAMPLE->data.Ctrl.Write.Ctrl1	=	SDQ_SAMPLE->data.RcvByte;
				//----------------当前地址与当前数据异或出结果再求对应结果的CRC
				temp	=	0x01^SDQ_SAMPLE->data.Ctrl.Write.Ctrl1;
				//----------------获取CRC
				SDQ_SAMPLE->data.SendByte		=	CRC8_8541_lsb(&temp,1);
				//----------------下一条操作为向主机返回CRC
				SDQ_SAMPLE->status	=	sdq_master_readCRC;
			}
			return 1;
		}
	}
	//====================向主机返回CRC
	//--------------------第一步返回CRC：原状态为向主机发送CRC，下一步为向主机发送控制寄存器状态
	else if(sdq_master_readCRC==SDQ_SAMPLE->status)
	{
		//----------------------发送CRC
		if(1==api_bq26100slave_send_byte())	//返回1表示发送完一字节
		{
			//------------------主机读完第一个CRC：下一步读取第一个状态寄存器值
			if(1 ==	SDQ_SAMPLE->data.Ctrl.Write.Serial)
			{
				//----------------控制寄存器0的值
				SDQ_SAMPLE->data.SendByte		=	SDQ_SAMPLE->data.Ctrl.Write.Ctrl0T;
				//----------------等待主机读取数据
				SDQ_SAMPLE->status	=	sdq_master_read;
			}
			//------------------主机读完第二个状态值的CRC：下一步读取第二个状态寄存器
			else if(2 ==	SDQ_SAMPLE->data.Ctrl.Write.Serial)
			{
				//----------------控制寄存器0的值
				SDQ_SAMPLE->data.SendByte		=	SDQ_SAMPLE->data.Ctrl.Write.Ctrl1;
				//----------------等待主机读取数据
				SDQ_SAMPLE->status	=	sdq_master_read;
			}
			//------------------
			else
			{
				SDQ_SAMPLE->status	=	sdq_ilde;		//主机继续发送下一字节数据
				//SDQ_SAMPLE->data.receivelen	=	0;
			}
			return 1;
		}
		return 1;
	}
	//====================第三步:返回寄存器值
	else if(sdq_master_read==SDQ_SAMPLE->status)
	{
		//----------------------发送数据
		if(1==api_bq26100slave_send_byte())	//返回1表示发送完一字节
		{
			//------------------主机读完第一个状态寄存器：下一步主机发送第二个状态寄存器值
			if(1 ==	SDQ_SAMPLE->data.Ctrl.Write.Serial)
			{
				//----------------等待主机发送寄存器1数据
				SDQ_SAMPLE->status	=	sdq_master_write;
			}
			//------------------主机读完第二个状态寄存器：完成整个写控制寄存器操作
			else if(2 ==	SDQ_SAMPLE->data.Ctrl.Write.Serial)
			{
				//----------------等待主机发送寄存器1数据：完成
				SDQ_SAMPLE->status	=	sdq_ilde;
				SDQ_SAMPLE->data.receivelen	=	0;
			}
		}
		return 1;
	}
	return 1;
}
//------------------------------------------------------------------------------



