quanhengwen/STM32F1xWorkSpace19/Driver/Components/SCR/BQ26100Slave - 20190722.C
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_digest_match_error(void)
{
	SDQ_SAMPLE->status	=	sdq_error;
	//api_bq26100slave_default();
	return 0;
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_get_error_status(void)
{
	//==================无错误:返回0
	if(sdq_error !=	SDQ_SAMPLE->status)
	{
		return 0;
	}
	//==================有错误:返回1
	else
	{
		return 1;
	}
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_reset_error_status(void)
{
	SDQ_SAMPLE->status	=	sdq_ilde;
	return 1;
}

//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short api_bq26100slave_get_receivelen(void)
{
	return SDQ_SAMPLE->data.receivelen;
}

//------------------------------------------------------------------------------



/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_send_bit(unsigned char bit)
{	
	SetBQ26100slavePinOutL;
	SetBQ26100slavePinLevel	=	bit;
	SysTick_DeleyuS(30);				//SysTick延时nuS
	SetBQ26100slavePinIntrr;
	return 1;
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_receive_bit(void)
{
	unsigned char flag=0;
	unsigned char bit = 0x80;
	//-----------------主机写数据或者空闲状态时
	if((sdq_start==SDQ_SAMPLE->status)||(sdq_ilde==SDQ_SAMPLE->status)||(sdq_master_write==SDQ_SAMPLE->status))
	{
		SDQ_SAMPLE->time.count=0;
		SDQ_SAMPLE->time.time_sys=0;	
		while(0==GetBQ26100slavePinLevel)
		{
			if(SysTick_GetVal()<2)
			{
				if(0==flag)
				{
					flag=1;
					SDQ_SAMPLE->time.time_sys+=1;
					break;
				}
			}
			else
			{
				flag=0;
			}
		}
		SDQ_SAMPLE->time.time2=SysTick_GetVal();							//获取当前SysTick计数值
		
		//------开始前时间少于500，去掉一次计数
		//------计算时长:9000为SYSTICK设置为1us时的重装载值
		
		SDQ_SAMPLE->time.time_sys=SDQ_SAMPLE->time.time_sys*9000+SDQ_SAMPLE->time.time1-SDQ_SAMPLE->time.time2;

		//------转换为us
		SDQ_SAMPLE->time.count=SDQ_SAMPLE->time.time_sys/SDQ_SAMPLE->time.timeper;
		
		//------
		//------启动条件：主机拉低信号480us-960us
		if(SDQ_SAMPLE->time.count>350)
		{	
			bit	= 0xFF;
		}
		//------主机写0:拉低信号60us-120us
		else if(SDQ_SAMPLE->time.count>50)
		{
			bit	= 0;
		}
		//------主机写1或者启动bit位读:拉低信号大于1us，总时间60us
		else if((SDQ_SAMPLE->time.count<15))
		{
			bit	= 1;
		}
	}
	return bit;		//其它未识别时间
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_send_byte(void)
{	
	api_bq26100slave_send_bit(SDQ_SAMPLE->data.SendByte&0x01);
	if(0==SDQ_SAMPLE->data.SendBitLen)
		RecordData(SDQ_SAMPLE->data.SendByte);
	//=======================右移一位:低位先传
	SDQ_SAMPLE->data.SendByte		>>=	1;
	//=======================传输计数
	SDQ_SAMPLE->data.SendBitLen	+=	1;
	
	if(8<=SDQ_SAMPLE->data.SendBitLen)
	{
		SDQ_SAMPLE->data.SendBitLen	=	0;
		return 1;		//发送完一字节数据
	}	
	return 0;		//未发送完
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_receive_byte(void)
{
	unsigned char bit=api_bq26100slave_receive_bit();
	//--------------------右移1位:低位先传输	
	SDQ_SAMPLE->data.RcvByte>>=1;
	if(0==bit)
	{		
		SDQ_SAMPLE->data.RcvByte&=0x7F;		
	}
	else if(1==bit)
	{
		SDQ_SAMPLE->data.RcvByte|=0x80;		
	}
	else if(0xFF == bit)
	{
		return 0xFF;
	}	
	//--------------------字节接收计数
	SDQ_SAMPLE->data.RcvBitlen+=1;
	//--------------------判断数据有无接收完一字节
	if(8<=SDQ_SAMPLE->data.RcvBitlen)
	{
		SDQ_SAMPLE->data.RcvBitlen	=	0;
		//========================将接收到的数据保存	
		if(SDQ_SAMPLE->data.receivelen<sdq_receive_buffer_size)
		{
			SDQ_SAMPLE->data.receive[SDQ_SAMPLE->data.receivelen]=SDQ_SAMPLE->data.RcvByte;
			SDQ_SAMPLE->data.receivelen+=1;
			return 1;		//接收完一字节
		}
		//------------------------缓存满
		else
		{
			return 0;
		}		
	}
	return 0;			//未接收完
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char api_bq26100slave_start(void)
{	
	//------启动条件：主机拉低信号480us-960us
	//------等待15us-60us后从机拉低总线60us-240us作为对主机的应答
	SetBQ26100slavePinOutH;
	SetBQ26100slavePinLevel=1;
	SysTick_DeleyuS(20);				//SysTick延时nuS
	SetBQ26100slavePinLevel=0;
	SysTick_DeleyuS(120);				//SysTick延时nuS
	SetBQ26100slavePinIntrr;
	
	return 1;
}
//------------------------------------------------------------------------------

