quanhengwen/STM32F1xWorkSpace19/Driver/Components/SCR/BQ26100Slave - 20190722.C
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char  api_bq26100slave_default(void)
{
//	//----------------time
//	SDQ_SAMPLE->time.high	=	0;
//	SDQ_SAMPLE->time.low	=	0;	
	
	//----------------data
	//SDQ_SAMPLE->data.intrrcout=0;
	SDQ_SAMPLE->data.startcout++;
	SDQ_SAMPLE->data.receivelen=0;
	SDQ_SAMPLE->data.addressL	=	0;
	SDQ_SAMPLE->data.addressH	=	0;
	//SDQ_SAMPLE->data.SendBitLen	=	0;
	SDQ_SAMPLE->data.SendByte	=	0;
	SDQ_SAMPLE->data.RcvBitlen	=	0;
	SDQ_SAMPLE->data.RcvByte	=	0;

	
	//---------------Message
	//SDQ_SAMPLE->data.Message.MessageLen=0;
	
	//---------------Digest
	SDQ_SAMPLE->data.Digest.Serial=0;	
	
	//----------------RomCmd
	SDQ_SAMPLE->RomCmd	=	sdq_rom_idle;
	
	//----------------MemCmd
	SDQ_SAMPLE->MemCmd	=	sdq_mem_idle;
	
	//----------------status
	SDQ_SAMPLE->status	=	sdq_start;
	return 1;
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void RecordData(unsigned char bytedata)
{
	static unsigned short serial=0;
	
	if(1==crflag)
	{
		bqrecord[serial]=bytedata;
		
		if(serial++>=20)
			serial=0;
	}
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char* api_bq26100slave_get_message_address(unsigned short serial)
{
	unsigned char* address = 0;
	if(serial<bq26100BufferSize)
		address = (unsigned char*)bq26100_sample_data[serial][0];
	else
		address = 0;
	return address;
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char* api_bq26100slave_get_digest_address(unsigned short serial)
{
	unsigned char* address = 0;
	if(serial<bq26100BufferSize)
		address = (unsigned char*)bq26100_sample_data[serial][1];
	else
		address = 0;
	return address;
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short api_bq26100slave_get_sample_data_size(void)
{
	return bq26100BufferSize;
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void EXTI9_5_IRQHandler(void)
{
	EXTI_ClearITPendingBit(EXTI_Line6);
	//=======================高电平:上升沿
	if(0==GetBQ26100slavePinLevel)	//低电平
	{	
		if((SDQ_SAMPLE->status==sdq_master_read)||(SDQ_SAMPLE->status==sdq_master_readCRC))
			SetBQ26100slavePinOutL;
		api_bq26100slave_process();
	}
	//=======================低电平:下降沿
	else
	{
		//----------启动总线
		//if(SDQ_SAMPLE->time.count>1000)
		//{
			//SDQ_SAMPLE->status=sdq_start;
		//}
	}
	EXTI_ClearITPendingBit(EXTI_Line6);
	//EXTI_ClearITPendingBit(EXTI_Line6);
}



